ERM/src/Enums/InvoiceStatus.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>InvoiceStatus</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>CustomerIsInsolventOrBankrupt</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PendingSLBDocumentation</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Pricing</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TechnicalSQ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LostInHole</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PendingInvoiceApproval</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PendingPaymentAllocation</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ClientConfirmedPayment</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>InvoicePaid</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EscalatedToSales</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>InvoiceNotDue</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CustomerIsUnavailable</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ClientHasLiquidityProblems</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ERM/src/Enums/InvoiceStatus/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	Список = Новый СписокЗначений;
	Список.Добавить(Перечисления.InvoiceStatus.CustomerIsInsolventOrBankrupt);
	Список.Добавить(Перечисления.InvoiceStatus.BankIssue);
	Список.Добавить(Перечисления.InvoiceStatus.Pricing);
	Список.Добавить(Перечисления.InvoiceStatus.TaxRetention);
	Список.Добавить(Перечисления.InvoiceStatus.ContractIssue);
	Список.Добавить(Перечисления.InvoiceStatus.InvalidPO);
	Список.Добавить(Перечисления.InvoiceStatus.MissingInvoice);
	Список.Добавить(Перечисления.InvoiceStatus.MissingPO);
	Список.Добавить(Перечисления.InvoiceStatus.MissingSupportingDocuments);
	Список.Добавить(Перечисления.InvoiceStatus.OverBudget);
	Список.Добавить(Перечисления.InvoiceStatus.PendingApprovalToPay);
	Список.Добавить(Перечисления.InvoiceStatus.WriteOff);
	Список.Добавить(Перечисления.InvoiceStatus.TechnicalSQ);
	Список.Добавить(Перечисления.InvoiceStatus.LostInHole);
	Список.Добавить(Перечисления.InvoiceStatus.BudgetIssue);
	Список.Добавить(Перечисления.InvoiceStatus.BillingError);
	Список.Добавить(Перечисления.InvoiceStatus.ClientConfirmedPayment);
	Список.Добавить(Перечисления.InvoiceStatus.InvoicePaid);
	Список.Добавить(Перечисления.InvoiceStatus.PartiallyPaid);
	Список.Добавить(Перечисления.InvoiceStatus.InvoiceNotDue);
	Список.Добавить(Перечисления.InvoiceStatus.PendingPaymentAllocation);
	Список.Добавить(Перечисления.InvoiceStatus.InvoiceOnApproval);
	
	ДанныеВыбора = Список;

КонецПроцедуры
